spring-soft/lychee-music/sdkconfig.defaults
# ===== 目标 =====
CONFIG_IDF_TARGET="esp32s3"

# ===== 主频 / 节拍 / 优化 =====
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ===== Flash 16MB / 分区表 =====
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# 这块板的分区表在 0x9000（不是 IDF 惯例的 0x8000），对齐 esp-claw
CONFIG_PARTITION_TABLE_OFFSET=0x9000

# ===== PSRAM: 8MB Octal @80MHz =====
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# bring-up 阶段开内存自检，稳定后关掉（省 1~2s 启动）
CONFIG_SPIRAM_MEMTEST=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# ===== 可观测性 =====
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ===== WiFi =====
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16

# ===== HTTP 客户端 / 服务端 =====
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
# ⚠️ 这两个是【每连接】的缓冲，乘上 socket 数就是内部 SRAM 的硬开销。
# 起播后内部 SRAM 只剩个位数 KB（解码器预编译库，内存挪不到 PSRAM），所以调小：
# 浏览器请求头不到 512 字节，我们的 URI 最长也就 /api/wifi/scan/result 这种。
CONFIG_HTTPD_MAX_REQ_HDR_LEN=768
CONFIG_HTTPD_MAX_URI_LEN=384
# 注意：httpd 的 max_open_sockets 不是 Kconfig 项，是 httpd_config_t 的运行时字段（默认 7），
# 在 web_console 组件里显式设置。
CONFIG_HTTPD_WS_SUPPORT=y

# ===== 音频解码器：只留要用的，砍体积 =====
# 符号来自 esp_audio_codec 组件（默认全部为 y，这里显式裁剪）
CONFIG_AUDIO_DECODER_MP3_SUPPORT=y
CONFIG_AUDIO_DECODER_AAC_SUPPORT=y
CONFIG_AUDIO_DECODER_FLAC_SUPPORT=y
CONFIG_AUDIO_DECODER_PCM_SUPPORT=y
CONFIG_AUDIO_DECODER_VORBIS_SUPPORT=n
CONFIG_AUDIO_DECODER_OPUS_SUPPORT=n
CONFIG_AUDIO_DECODER_ALAC_SUPPORT=n
CONFIG_AUDIO_DECODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_DECODER_SBC_SUPPORT=n
CONFIG_AUDIO_DECODER_LC3_SUPPORT=n
CONFIG_AUDIO_DECODER_G722_SUPPORT=n
CONFIG_AUDIO_DECODER_G711_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRWB_SUPPORT=n

# ===== LVGL 9.6 =====
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_OS_FREERTOS=y
# 用 IDF 的堆（能被 PSRAM 感知），不再养第二套内存池
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# 字体：中文走 assets 里的 bin 字体，拉丁/数字用内置 Montserrat
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_FS_MEMFS=y
CONFIG_LV_FS_MEMFS_LETTER=77
CONFIG_LV_USE_LOG=y
CONFIG_LV_USE_ASSERT_NULL=y
CONFIG_LV_USE_ASSERT_MALLOC=y

# ===== BLE (NimBLE HID 遥控) =====
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# ★ HID 服务：不选它 NimBLE 里就没有 0x1812，esp_hid 会初始化失败
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
CONFIG_SW_COEXIST_ENABLE=y

# ===== LwIP TCP 窗口 =====
# ⚠️ 这个局域网 RTT 高达 66~164ms（WiFi 侧），而默认窗口只有 ~5.7KB(4×MSS)：
#    30KB 的 JSON 要 11 个来回 ≈ 1.6 秒。放大窗口把来回次数砍到 2~3 次。
#    代价：每条连接多占约 16KB 内存，当前连接数少（元数据 + 音频流）可以接受。
CONFIG_LWIP_TCP_WND_DEFAULT=16384
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
# ⚠️ ⚠️ lwIP 的 socket 上限是【全局】的：httpd 要 max_open_sockets+3 个
#     （默认 socket 数 10，而我们给 httpd 配 6 → 6+3=9），
#     再加音频流 1 个 + 元数据 keep-alive 1 个 = 11 > 10 —— 于是间歇性 socket() 失败，
#     新连接的 SYN 被丢，客户端要等 ~1 秒 TCP 初始重传。
#     症状：多数请求 20~70ms，但偶尔冒出 1.06s / 1.3s 的尖峰（实测抓到过）。
CONFIG_LWIP_MAX_SOCKETS=16
